app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 13 Oct 2017 13:13:29 UTC +00:00], ["email", ""], ["name", ""], ["updated_at", Fri, 13 Oct 2017 13:13:29 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Krishna Vootla"], ["email", "krishnayad05@gmail.com"], ["updated_at", Fri, 13 Oct 2017 13:14:02 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)